# Importing Dependencies

In [10]:
import numpy as np
import pandas as pd

# 1. Prepare the sample csv file for car model and their specification, the column names would be   
- Company Name  
- Model Name  
- Fuel Type (For e.g. Petrol, Gas, Diesel, EV)  
- Body Style (for e.g. Hatchback, Sedan, SUV)  
- Car Length

In [11]:
data = {"Company_Name":["Maruthi Suzuki","Hyundai","Toyota"],"Model_Name":["Swift","i20","Fortuner"],"Fuel_Type":["Diesel","Petrol","Diesel"],"Body_Style":["SUV","Hatchback","SUV"],"Car_Length":["3998mm","3995mm","4315mm"]}
df = pd.DataFrame(data)
df

     Company_Name Model_Name Fuel_Type Body_Style Car_Length
0  Maruthi Suzuki      Swift    Diesel        SUV     3998mm
1         Hyundai        i20    Petrol  Hatchback     3995mm
2          Toyota   Fortuner    Diesel        SUV     4315mm

## create csv file

In [12]:
df.to_csv("car.csv")

# 2. Prepare the sample excel file for the car prizing and loan amount, the column names would be  
- Company Name     
- Model Name  
- On road pricing  
- Loan amount  
- Monthly EMI  
- Interest Rate  
- Monthly Principal  
- Monthly Interest

In [13]:
data = {"Company_Name":["Maruthi Suzuki","Hyundai","Toyota"],"Model_Name":["Swift","i20","Fortuner"],"On_Road_Pricing":["800000","1200000","1100000"],"Loan_Amount":["500000","1000000","1000000"]," Monthly_EMI":["52000","45000","35000"],"Interest_Rate":["8","6","9"],"Monthly_Principal":["8000","9000","7800"]," Monthly_Interest":["10000","9000","8900"]}
dataset = pd.DataFrame(data)
dataset

,Company_Name,Model_Name,On_Road_Pricing,Loan_Amount,Monthly_EMI,Interest_Rate,Monthly_Principal,Monthly_Interest
0,Maruthi Suzuki,Swift,800000,500000,52000,8,8000,10000
1,Hyundai,i20,1200000,1000000,45000,6,9000,9000
2,Toyota,Fortuner,1100000,1000000,35000,9,7800,8900

## Create excel file

In [14]:
dataset.to_excel("car_price.xlsx")

# 3. Write the code to read the csv file and the excel file and convert them into the Data frame.

## read the csv file

In [15]:

csv_data = pd.read_csv("car.csv")
csv_data

   Unnamed: 0    Company_Name Model_Name Fuel_Type Body_Style Car_Length
0           0  Maruthi Suzuki      Swift    Diesel        SUV     3998mm
1           1         Hyundai        i20    Petrol  Hatchback     3995mm
2           2          Toyota   Fortuner    Diesel        SUV     4315mm

## Read the excel file

In [16]:
excel_data = pd.read_excel("car_price.xlsx")
excel_data

,Unnamed: 0,Company_Name,Model_Name,On_Road_Pricing,Loan_Amount,Monthly_EMI,Interest_Rate,Monthly_Principal,Monthly_Interest
0,0,Maruthi Suzuki,Swift,800000,500000,52000,8,8000,10000
1,1,Hyundai,i20,1200000,1000000,45000,6,9000,9000
2,2,Toyota,Fortuner,1100000,1000000,35000,9,7800,8900

# 4. Merge the two Data frame on the basis of primary key

In [17]:
merged_data = csv_data.merge(excel_data, on="Company_Name")
merged_data

,Unnamed: 0_x,Company_Name,Model_Name_x,Fuel_Type,Body_Style,Car_Length,Unnamed: 0_y,Model_Name_y,On_Road_Pricing,Loan_Amount,Monthly_EMI,Interest_Rate,Monthly_Principal,Monthly_Interest
0,0,Maruthi Suzuki,Swift,Diesel,SUV,3998mm,0,Swift,800000,500000,52000,8,8000,10000
1,1,Hyundai,i20,Petrol,Hatchback,3995mm,1,i20,1200000,1000000,45000,6,9000,9000
2,2,Toyota,Fortuner,Diesel,SUV,4315mm,2,Fortuner,1100000,1000000,35000,9,7800,8900